Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem
Base class for all Building Hierarchy object types.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.Name
Gets or sets the Name of the hierarchic object.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.SetGuid(System.Guid)
Sets Guid for Building Hierarchy object. To be used when selecting object.
guid: Guid of the Building Hierarchy object.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.GetGuid
Gets Guid of Building Hierarchy object.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.SelectAssignedObjects
Select assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.HideAssignedObjects
Hide assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.ShowAssignedObjects
Show previously hidden assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.ShowOnlyAssignedObjects
Show only assigned objects in 3d view.

Tekla.Structures.ModelInternal.BuildingHierarchy.BuildingHierarchyItem.GetBHType
Get currect object type, for interoperability purposes.
Returns: The object type.